# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [3]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [4]:
series_1 = pd.DataFrame(np.random.randint(1,5,size=(100, 1)), columns=list('A'))
series_2 = pd.DataFrame(np.random.randint(1,4,size=(100, 1)), columns=list('A'))
series_3 = pd.DataFrame(np.random.randint(10000,30001,size=(100, 1)), columns=list('A'))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [5]:
series_final = pd.concat([series_1, series_2, series_3], axis=1)
series_final

    A  A      A
0   3  1  25515
1   2  2  16161
2   3  1  17201
3   1  2  19290
4   4  1  27256
.. .. ..    ...
95  3  2  27448
96  3  3  27371
97  4  2  15751
98  3  2  19831
99  1  2  23629

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [6]:
series_final.columns = ['bedrs', 'bathrs', 'price_sqr_meter']
series_final

    bedrs  bathrs  price_sqr_meter
0       3       1            25515
1       2       2            16161
2       3       1            17201
3       1       2            19290
4       4       1            27256
..    ...     ...              ...
95      3       2            27448
96      3       3            27371
97      4       2            15751
98      3       2            19831
99      1       2            23629

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [7]:
bigcolumn = pd.concat([series_1, series_2, series_3])
bigcolumn

        A
0       3
1       2
2       3
3       1
4       4
..    ...
95  27448
96  27371
97  15751
98  19831
99  23629

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [8]:
#false, we see that new DataFrame hasa 300 rows, indexes are kept

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [13]:
one_to_hundred = pd.Series(range(1,301))
print(one_to_hundred)
bigcolumn['one_to_hundred'] = one_to_hundred
print(bigcolumn['one_to_hundred'])
bigcolumn.set_index('one_to_hundred',inplace=True)

0        1
1        2
2        3
3        4
4        5
      ...
295    296
296    297
297    298
298    299
299    300
Length: 300, dtype: int64
one_to_hundred
4        5
5        6
6        7
7        8
8        9
      ...
99     100
100    101
101    102
102    103
103    104
Name: one_to_hundred, Length: 300, dtype: int64